{"path": "./Audit_Reports_2024/HAECHI_AUDIT/[HAECHI AUDIT] Luxon airdrop_gacha Audit Report.pdf", "project_info": {"url": "https://github.com/nerdy-star/nerdy_smart_contract/tree/", "commit_hash": "fd914ea5731494c1c0d291352495e4d26f196fa4", "address": "N/A"}, "findings": [{"id": 0, "category": {"1": ["CWE-693"], "2": ["CWE-330"], "3": ["CWE-335"], "4": ["CWE-337"]}, "title": "Block dependent information is used as seed to generate random value.", "description": "Using block-dependent information (e.g., block.timestamp) as a seed to generate random values can be predictable by malicious actors and is therefore insecure.", "severity": "High", "contract": "N/A", "function": ["randomTier", "randomCharacterNum"], "lineNumber": "N/A"}, {"id": 1, "category": {"1": ["CWE-682"]}, "title": "Unintended count update may occur on the CharacterInfo if isValid value is set to false.", "description": "The characterCount storage variable is increased by 1 if the isValid value of characterInfo is set false, but there is no decrease in implementation if the isValid of characterInfo structure is true, leading to unintended increase in characterCount.", "severity": "Medium", "contract": "CharacterData", "function": "setCharacterData()", "lineNumber": "N/A"}, {"id": 2, "category": {"1": ["CWE-710"], "2": ["CWE-1041"]}, "title": "Unnecessary require code on the ERC1155LUXON.burn function.", "description": "The burn function has redundant ownership checks which can be removed to reduce gas fees as only superOperators can call this function.", "severity": "Low", "contract": "ERC1155LUXON", "function": "burn(address, uint256, uint256)", "lineNumber": "N/A"}, {"id": 3, "category": {"1": ["CWE-707"], "2": ["CWE-20"]}, "title": "Unnecessary memory variable allocation on the ERC721LUXON.mintLuxOn function.", "description": "There is an unnecessary array variable(tokenIds) in memory allocation on the process of mintLuxOn function of ERC721LUXON Contract, which can be removed to save gas fee.", "severity": "Medium", "contract": "ERC721LUXON", "function": "mintLuxOn(address,uint256,string[])", "lineNumber": "N/A"}, {"id": 4, "category": {"1": ["CWE-703"], "2": ["CWE-754"], "3": ["CWE-391"]}, "title": "Several important variable changes have no event emissions.", "description": "Critical variable changes lack event emissions, which can reduce project visibility.", "severity": "High", "contract": "Multiple contracts (DspCharacterData, DspGachaData, AirdropGachaTicket, ERC721Centralization, GachaMachineByGachaTicket, LuxOnLive, LuxOnSuperOperators)", "function": "Multiple functions (setCharacterData, deleteCharacterData, setGachaInfo, setGachaInfos, removeGachaInfo, setMintAddress, setGachaDataAddress, setAirdropUserAddress, setAirdropRemainCount, addAirdropRemainCount, subAirdropRemainCount, airdrop, airdropMany, addToeknAddresses, setRealOwnerOnce, setRealOwner, transferCenter, setMintGoodsInfo, setCentralizationAddress, setCharacterDataAddress, setLuxOnService, setLuxOnAdmin, setOperator)", "lineNumber": "N/A"}, {"id": 5, "category": {"1": ["CWE-703"]}, "title": "Out of Gas error may be expected on airdropMany function", "description": "Using a large number of AirdropInfo parameters with the airdropMany function can lead to an out-of-gas error.", "severity": "Major", "contract": "AirdropGacTicket", "function": "airdropMany()", "lineNumber": "N/A"}]}