{"path": "./Audit_Reports_2024/Runtime_Vеrification/Algodex_Dec.pdf", "project_info": {"url": "N/A", "commit_hash": "N/A", "address": "N/A"}, "findings": [{"id": 0, "category": {"1": ["CWE-693"], "2": ["CWE-807"]}, "title": "Missing on-chain safeguards in case of compromised front-end", "description": "The application lacks on-chain sanity checks to mitigate the impact of a compromised off-chain front-end, which can alter transaction groups and harm users.", "severity": "High", "contract": "N/A", "function": "N/A", "lineNumber": "N/A"}, {"id": 1, "category": {"1": ["CWE-435"], "2": ["CWE-436"]}, "title": "Inconsistency between transaction checks made in escrow and orderbook", "description": "Certain checks are not specified identically in both contracts, which opens up the possibility of malicious actors trying to confuse the escrow and order book regarding the transaction group structure.", "severity": "Informative", "contract": "N/A", "function": "N/A", "lineNumber": "N/A"}, {"id": 2, "category": {"1": ["CWE-710"], "2": ["CWE-1068"]}, "title": "Inconsistency in structure of transaction checks", "description": "The protocol code lacks a consistent structure for performing transaction checks, which can lead to maintainability issues and make it harder to detect inconsistent or missing logic during development.", "severity": "Informative", "contract": "N/A", "function": "N/A", "lineNumber": "N/A"}, {"id": 3, "category": {"1": ["CWE-284"], "2": ["CWE-285"], "3": ["CWE-732"]}, "title": "Opportunity to eliminate requirement of refund transactions", "description": "The protocol can eliminate the refund transaction from transaction groups and check that fees spent by escrows are always 0, as the Algorand Virtual Machine now supports pooling of transaction fees.", "severity": "Informative", "contract": "N/A", "function": "N/A", "lineNumber": "N/A"}, {"id": 4, "category": {"1": ["CWE-710"], "2": ["CWE-1076"]}, "title": "Opportunity for codebase improvement by using TEAL v5", "description": "The protocol can benefit from new features introduced by version 5 of the TEAL language, which can simplify the protocol and increase its security.", "severity": "Informative", "contract": "N/A", "function": "N/A", "lineNumber": "N/A"}]}