{
    "path": "./Audit_Reports_2024/Runtime_Vеrification/EXA_Finance.pdf",
    "project_info": {
        "url": "https://github.com/malturki/tealer",
        "commit_hash": "66e4d25caf7e661ec90f6091301d5688850b1ff1",
        "address": "N/A",
        "is_exists": true
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-284"
                ],
                "2": [
                    "CWE-285"
                ],
                "3": [
                    "CWE-732"
                ]
            },
            "title": "A01: Addresses must be able to receive assets",
            "description": "The contract performs asset transfers without checking if the recipient addresses have opted in to the assets being sent, which can cause transfer failures and lock assets in the contract.",
            "severity": "High",
            "contract": "N/A",
            "function": "N/A",
            "lineNumber": "N/A"
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-682"
                ]
            },
            "title": "A02: Reverse auction price calculation allows for purchase of assets with no payment",
            "description": "The equation used for price calculation in the reverse auction exchange model allows for users to buy the auctioned basket and pay with an asset transfer or payment of amount 0, where the only expense of the buyer would be the fees for the transaction group.",
            "severity": "High",
            "contract": "N/A",
            "function": "N/A",
            "lineNumber": "N/A"
        },
        {
            "id": 2,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-404"
                ],
                "3": [
                    "CWE-772"
                ],
                "4": [
                    "CWE-401"
                ]
            },
            "title": "The funds submitted by a previous bidder might not be refunded to their rightful owner",
            "description": "If a user bids in an auction and opts out from the asset used to bid, it will not be possible to issue a refund if his bid is surpassed.",
            "severity": "Medium",
            "contract": "N/A",
            "function": "N/A",
            "lineNumber": "N/A"
        },
        {
            "id": 3,
            "category": {
                "1": [
                    "CWE-703"
                ],
                "2": [
                    "CWE-754"
                ]
            },
            "title": "A04: It is possible to fund baskets with no assets",
            "description": "There are no checks that prevent a seller from transferring 0 amounts of an asset when funding the basket.",
            "severity": "Medium",
            "contract": "N/A",
            "function": "N/A",
            "lineNumber": "N/A"
        },
        {
            "id": 4,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-666"
                ],
                "3": [
                    "CWE-672"
                ]
            },
            "title": "A05: Assets stay locked in the contract if auction winner refuses or becomes unable to claim",
            "description": "In the normal auction exchange model, once the auction ends, the buyer has to claim the auctioned assets in order to transfer the fees to the fee address and royalties addresses, as well as the payment to the seller. Since the buyer is the only one that can trigger the claim operation, no other actor involved will be able to initiate the process of asset transfer to their respective owners.",
            "severity": "Medium",
            "contract": "N/A",
            "function": "N/A",
            "lineNumber": "N/A"
        },
        {
            "id": 5,
            "category": {
                "1": [
                    "CWE-697"
                ]
            },
            "title": "A06: It is possible to interact with non-funded baskets",
            "description": "The contract logic allows for the interaction of users with non-funded baskets, causing a panic behavior in the AVM when comparing the zero address in bytes format with the value of a non-populated global.",
            "severity": "Medium",
            "contract": "N/A",
            "function": "N/A",
            "lineNumber": "N/A"
        },
        {
            "id": 6,
            "category": {
                "1": [
                    "CWE-664"
                ],
                "2": [
                    "CWE-400"
                ],
                "3": [
                    "CWE-770"
                ]
            },
            "title": "A07: Fees accumulate in the contract if the royalties address is missing or no royalties fee are specified",
            "description": "In the shopping cart exchange model, fees accumulate in the contract if the royalties address is missing or no royalties fee are specified. This can be exploited by a malicious user to accumulate algos in the contract.",
            "severity": "Low",
            "contract": "N/A",
            "function": "N/A",
            "lineNumber": "N/A"
        },
        {
            "id": 7,
            "category": {
                "1": [
                    "CWE-682"
                ],
                "2": [
                    "CWE-1339"
                ]
            },
            "title": "Bid price malfunction due to precision loss",
            "description": "Loss due to rounding when calculating the minimum amount for bids, which can cause precision loss and bypass the check that evaluates if the attempted bid is at least 1% greater than the minimum bid price.",
            "severity": "Low",
            "contract": "N/A",
            "function": "N/A",
            "lineNumber": "1196"
        },
        {
            "id": 8,
            "category": {
                "1": [
                    "CWE-682"
                ],
                "2": [
                    "CWE-193"
                ]
            },
            "title": "A09: Royalties and fees loss due to rounding",
            "description": "Both the fee and royalty amount calculations are subject to loss due to rounding.",
            "severity": "Low",
            "contract": "N/A",
            "function": "N/A",
            "lineNumber": "435, 1194"
        },
        {
            "id": 9,
            "category": {
                "1": [
                    "CWE-682"
                ],
                "2": [
                    "CWE-193"
                ]
            },
            "title": "A10: No start time and end time verification",
            "description": "There are no checks to verify if the start time is smaller than the end time, which can be exploited by malicious users to prevent legitimate users from buying an item or inducing users into interacting with an auction that has ended before it started.",
            "severity": "Low",
            "contract": "N/A",
            "function": "N/A",
            "lineNumber": "N/A"
        },
        {
            "id": 10,
            "category": {
                "1": [
                    "CWE-703"
                ],
                "2": [
                    "CWE-754"
                ]
            },
            "title": "A11: No checks on the price reduction interval",
            "description": "The implementation of the reverse auction exchange model does not check if the price reduction interval is greater than 0, which can cause panic behavior in the AVM and enable griefing attacks.",
            "severity": "Low",
            "contract": "N/A",
            "function": "N/A",
            "lineNumber": "1592"
        },
        {
            "id": 11,
            "category": {
                "1": [
                    "CWE-703"
                ],
                "2": [
                    "CWE-754"
                ]
            },
            "title": "A12: No checks on the maximum amount purchased per transaction in shopping carts",
            "description": "There are no checks to ensure that the maximum number of assets purchased in a transaction using the shopping cart exchange model is greater than 0, allowing malicious users to trick others into attempting to buy unavailable assets, resulting in microAlgo losses in fees.",
            "severity": "Low",
            "contract": "N/A",
            "function": "N/A",
            "lineNumber": "N/A"
        },
        {
            "id": 12,
            "category": {
                "1": [
                    "CWE-703"
                ],
                "2": [
                    "CWE-754"
                ]
            },
            "title": "A13: No checks on specific Algorand fields and properties",
            "description": "The contract does not verify specific Algorand fields and properties, which may lead to misconfigured transactions or interference by malicious third parties, impacting assets held by an account.",
            "severity": "Low",
            "contract": "N/A",
            "function": "N/A",
            "lineNumber": "N/A"
        },
        {
            "id": 13,
            "category": {
                "1": [
                    "CWE-682"
                ],
                "2": [
                    "CWE-190"
                ]
            },
            "title": "A14: No boundaries in the royalty fees and platform fees leading to possible overflows and underflows",
            "description": "There are no checks that limit the amount of royalties and fees to be paid. Royalties can exceed 10000, while the fee percentage can exceed 100.",
            "severity": "Low",
            "contract": "N/A",
            "function": "N/A",
            "lineNumber": "433, 1192"
        },
        {
            "id": 14,
            "category": {
                "1": [
                    "CWE-682"
                ],
                "2": [
                    "CWE-190"
                ]
            },
            "title": "A15: Overflow possibility in reverse auctions",
            "description": "In a reverse auction, if a user specifies a time to price that is, in orders of magnitude, greater than the time reduction interval, it is possible that no user can purchase the basket for some period of time.",
            "severity": "Low",
            "contract": "N/A",
            "function": "N/A",
            "lineNumber": "N/A"
        },
        {
            "id": 15,
            "category": {
                "1": [
                    "CWE-682"
                ],
                "2": [
                    "CWE-190"
                ]
            },
            "title": "A16: Overflow possibility in shopping cart purchase when multiplying the base price by the amount bought",
            "description": "There is a possibility for overflow when purchasing from shopping carts due to lack of checks to verify if there can be an overflow when multiplying the parameter given by the buyer (amount bought) with the price asset amount.",
            "severity": "Low",
            "contract": "N/A",
            "function": "N/A",
            "lineNumber": "N/A"
        },
        {
            "id": 16,
            "category": {
                "1": [
                    "CWE-682"
                ]
            },
            "title": "B01: Effects of the Algorand block generation time",
            "description": "Since it takes roughly 4.5 seconds to generate a block in the Algorand blockchain, depending on the timing when the transaction is submitted, it is possible to bid/purchase assets up to 4.5 seconds after the end of the auction/sale.",
            "severity": "Low",
            "contract": "N/A",
            "function": "N/A",
            "lineNumber": "N/A"
        },
        {
            "id": 17,
            "category": {
                "1": [
                    "CWE-682"
                ],
                "2": [
                    "CWE-193"
                ]
            },
            "title": "B02: Unnecessary conditional",
            "description": "There is an unnecessary check starting at line 1526. First, there is a check to evaluate if the index of the transaction in the group is 0, and right after it there is another check to see if the transaction group has only 1 transaction.",
            "severity": "-",
            "contract": "N/A",
            "function": "N/A",
            "lineNumber": "1526"
        },
        {
            "id": 18,
            "category": {
                "1": [
                    "CWE-284"
                ],
                "2": [
                    "CWE-285"
                ],
                "3": [
                    "CWE-863"
                ]
            },
            "title": "Transaction groups can include opt-ins unrelated to the platform",
            "description": "The function fn_check_is_optin_tx only checks if the transaction is an optin, but does not verify if a seller is opting in to the price asset or if a buyer is opting in to all the assets in the basket.",
            "severity": "Low",
            "contract": "N/A",
            "function": "fn_check_is_optin_tx",
            "lineNumber": "N/A"
        },
        {
            "id": 19,
            "category": {
                "1": [
                    "CWE-710"
                ],
                "2": [
                    "CWE-1068"
                ]
            },
            "title": "B04: Fee pooling functionality is not used",
            "description": "The contract can make use of the fee pooling functionality to send the fees in another mandatory transaction of the group, instead of having an exclusive transaction responsible for this.",
            "severity": "Low",
            "contract": "N/A",
            "function": "N/A",
            "lineNumber": "N/A"
        }
    ]
}