{
    "path": "./Audit_Reports_2024/New_Alchemy_Security_Audit/New_Alchemy_Security_Audit-The Abyss Token%U00A0Audit.pdf",
    "project_info": {
        "url": "https://github.com/theabyssportal/SmartContract/",
        "commit_hash": "b03a3227c25dc19b4f173a64049b8fe13c8ccae2",
        "address": "N/A",
        "is_exists": false
    },
    "findings": [
        {
            "id": 0,
            "category": {
                "1": [
                    "CWE-682"
                ]
            },
            "title": "Potential gas price issue",
            "description": "This modifier uses an assert statement which checks the transaction’s gas price, and will fail if the gas price is too high.",
            "severity": "Minor",
            "contract": "The Abyss",
            "function": "N/A",
            "lineNumber": "N/A"
        },
        {
            "id": 1,
            "category": {
                "1": [
                    "CWE-682"
                ]
            },
            "title": "Incorrectly set dates for preSaleStartTime, preSaleEndTime, saleStartTime, saleEndTime, bonusWindow1EndTime, bonusWindow2EndTime, and bonusWindow3EndTime",
            "description": "The values for these variables are still set to zero. It is intended that these values are set as the contract is launched. However, there exists a possibility for the user deploying the contract to make an error while entering the values of these variables.",
            "severity": "Minor",
            "contract": "N/A",
            "function": "N/A",
            "lineNumber": "99-107"
        },
        {
            "id": 2,
            "category": {
                "1": [
                    "CWE-703"
                ],
                "2": [
                    "CWE-754"
                ]
            },
            "title": "No implementation of soft cap of 5000 ETH",
            "description": "The contract does not implement a soft cap of 5000 ETH as mentioned on the website describing the crowdsale.",
            "severity": "Minor",
            "contract": "TheAbyssCrowdsale",
            "function": "N/A",
            "lineNumber": "N/A"
        },
        {
            "id": 3,
            "category": {
                "1": [
                    "CWE-703"
                ],
                "2": [
                    "CWE-754"
                ]
            },
            "title": "Lack of functionality to change dates after contract launch but before presale begins",
            "description": "The contract does not have a function to update specific dates (preSaleStartTime, preSaleEndTime, saleStartTime, saleEndTime, bonusWindow1EndTime, bonusWindow2EndTime, and bonusWindow3EndTime) after the contract is launched but before the presale begins. This can lead to inconsistent behavior if these dates are entered incorrectly.",
            "severity": "Minor",
            "contract": "The Abyss Token",
            "function": "N/A",
            "lineNumber": "99-107"
        },
        {
            "id": 4,
            "category": {
                "1": [
                    "CWE-691"
                ],
                "2": [
                    "CWE-841"
                ]
            },
            "title": "Potential for inconsistent behaviors if date-changing functionality is added after presale has begun",
            "description": "If Destiny.Games adds date-changing functionality to the contract after the presale begins, it could lead to inconsistent behaviors that may not be welcome by contributors.",
            "severity": "Minor",
            "contract": "N/A",
            "function": "N/A",
            "lineNumber": "N/A"
        }
    ]
}