{"path": "./Audit_Reports_2024/Verichains_Lab/Verichains Public Audit Report - ArenaPixel Token -  v1.1.pdf", "project_info": {"url": "N/A", "commit_hash": "N/A", "address": "N/A"}, "findings": [{"id": 0, "category": {"1": ["CWE-284"], "2": ["CWE-285"], "3": ["CWE-863"]}, "title": "A01.Blacklist mechanism of transferFrom function can be bypassed", "description": "The blacklist mechanism in the transferFrom function can be bypassed if a blacklisted user uses another wallet to call with a sender parameter that is a blacklist, allowing the transfer to be successful.", "severity": "High", "contract": "Arena Pixel", "function": "transferFrom()", "lineNumber": "N/A"}, {"id": 1, "category": {"1": ["CWE-707"], "2": ["CWE-20"]}, "title": "Lack of input validation when set start time for eco stages details and dev stage details", "description": "The functions setEcoStage and setDevStage do not validate the input _stages values containing zero, potentially leading to incorrect start times for eco stages and dev stages.", "severity": "N/A", "contract": "N/A", "function": ["setEcoStage", "setDevStage"], "lineNumber": "N/A"}, {"id": 2, "category": {"1": ["CWE-703"], "2": ["CWE-754"], "3": ["CWE-391"]}, "title": "The lack of event emission when change configurations", "description": "Certain methods suffer from the lack of event emission for global variable adjustments, leading to worse user experience, limited automation, lower transparency, and insufficient audit trails.", "severity": "Medium", "contract": "N/A", "function": "setSellTax, setBuyTax, enableTax, addExcludeFee, removeExcludeFee, setMktWallet, setEcosystemWallet, setDevWallet, setPauseContract", "lineNumber": "N/A"}, {"id": 3, "category": {"1": ["CWE-707"], "2": ["CWE-20"]}, "title": "Missing zero address validation", "description": "The missing zero address validation in certain methods, namely setMktWallet, setEcosystemWallet, and setDevWallet, has negative implications. When the owner sets the zero address as the wallet address, it prevents the contract from transferring tokens to other users.", "severity": "Critical", "contract": "N/A", "function": "setMktWallet, setEcosystemWallet, and setDevWallet", "lineNumber": "N/A"}, {"id": 4, "category": {"1": ["CWE-284"], "2": ["CWE-285"], "3": ["CWE-732"]}, "title": "Approve for a pancake pair allowed to spend all tokens that is unnecessary", "description": "The Pancake pair is able to use all tokens when using the 'approve' procedure. Since the Pancake pair only needs to expend the tokens required for the swap, this is not necessary.", "severity": "Medium", "contract": "N/A", "function": "constructor", "lineNumber": "N/A"}, {"id": 5, "category": {"1": ["CWE-284"], "2": ["CWE-269"]}, "title": "Centralized mechanism", "description": "The contract uses a centralized mechanism to allow the owner to interact with the functions of the contract, which may lead to security risks if the owner account is compromised.", "severity": "High", "contract": "N/A", "function": "setPauseContract, addBlacklist, removeBlacklist, setSellTax, setBuyTax, enableTax, addExcludeFee, removeExcludeFee, removeExcludeFee, setEcosystemWallet, setDevWallet, setTgeTime, setEcoStage, setDevStage", "lineNumber": "N/A"}]}