{"path": "./Audit_Reports_2024/Trail_of_Bits/2023-03-walletconnectv2-securityreview.pdf", "project_info": {"url": "N/A", "commit_hash": "N/A", "address": "N/A"}, "findings": [{"id": 0, "category": {"1": ["CWE-710"], "2": ["CWE-477"]}, "title": "Use of outdated dependencies", "description": "The codebase uses vulnerable packages referenced by package-lock.json files.", "severity": "Informational", "contract": "N/A", "function": "N/A", "lineNumber": "N/A"}, {"id": 1, "category": {"1": ["CWE-693"], "2": ["CWE-345"], "3": ["CWE-353"]}, "title": "No protocol-level replay protections in WalletConnect", "description": "Applications and wallets using WalletConnect v2 can exchange messages using the WalletConnect protocol through a public WebSocket relay server. Exchanged data is encrypted and authenticated with keys unknown to the relay server. However, using this protocol, there does not seem to be any validation against nonce value (except validation that it exists), so the library would accept replayed signatures.", "severity": "Undetermined", "contract": "N/A", "function": "N/A", "lineNumber": "N/A"}, {"id": 2, "category": {"1": ["CWE-682"], "2": ["CWE-193"]}, "title": "Key derivation code could produce keys composed of all zeroes", "description": "The current implementation of the key derivation code using the x25519 library does not enable the rejectZero option, which may result in a derived key composed of all zeros if the counterparty is compromised, allowing an attacker to observe or tamper with the communication.", "severity": "Informational", "contract": "walletconnect-monorepo/packages/utils/src/crypto.ts", "function": "deriveSymKey", "lineNumber": "35-43"}, {"id": 3, "category": {"1": ["CWE-284"]}, "title": "Insecure storage of session data in local storage", "description": "HTML5 local storage is used to hold session data, including keychain values. Because there are no access controls on modifying and retrieving this data using JavaScript, data in local storage is vulnerable to XSS attacks.", "severity": "Medium", "contract": "N/A", "function": "N/A", "lineNumber": "N/A"}]}