{"path": "./Audit_Reports_2024/Trail_of_Bits/argo-threatmodel.pdf", "project_info": {"url": "N/A", "commit_hash": "N/A", "address": "N/A"}, "findings": [{"id": 0, "category": {"1": ["CWE-703"], "2": ["CWE-754"], "3": ["CWE-391"]}, "title": "Insufficient logging of dropped events", "description": "Currently, Argo Events logs information regarding NATS streaming server connections, subscriptions, and requests and responses between sensors and trigger destinations, as well as various pipeline delivery information from event sources. However, there may be insufficient logging performed when events are dropped from the event delivery queue due to a delivery failure.", "severity": "Low", "contract": "N/A", "function": "N/A", "lineNumber": "N/A"}, {"id": 1, "category": {"1": ["CWE-691"], "2": ["CWE-362"]}, "title": "Undocumented potential race condition in Event Bus", "description": "Events placed in the event bus may be meant to undergo processing by sensors in a first-in-first-out (FIFO) fashion. However, if a sensor receives an event and is unable to fire the corresponding trigger, it may grab the next message from the bus and process it before it retries sending the original message.", "severity": "Medium", "contract": "N/A", "function": "N/A", "lineNumber": "N/A"}, {"id": 2, "category": {"1": ["CWE-707"], "2": ["CWE-116"], "3": ["CWE-838"]}, "title": "Event Bus contains plaintext events", "description": "Events are commonly placed in the event bus through base64 encoding without proper cryptography, allowing an attacker with access to the event bus to discern all received events.", "severity": "Low", "contract": "N/A", "function": "N/A", "lineNumber": "N/A"}, {"id": 3, "category": {"1": ["CWE-703"], "2": ["CWE-754"]}, "title": "Events cannot be optionally rate limited", "description": "Events can be given a customizable expiration date but there is no rate-limiting method for events being received and processed, which may lead to performance or integrity issues.", "severity": "Medium", "contract": "N/A", "function": "N/A", "lineNumber": "N/A"}]}