{"path": "./Audit_Reports_2024/Coinspect/Coinspect-Grin Security Audit.pdf", "project_info": {"url": "https://github.com/mimblewimble/grin-wallet", "commit_hash": "7678aceddfd3e6af01632e2123f068457ee5164e", "address": "N/A"}, "findings": [{"id": 0, "category": {"1": ["CWE-284"], "2": ["CWE-285"], "3": ["CWE-863"]}, "title": "Remote file system write access and code execution during TxHashSet processing", "description": "Lack of input validation during the processing of TxHashSetArchive messages enables remote attackers to obtain file system write access and arbitrary code execution as a consequence.", "severity": "High", "contract": "N/A", "function": "decompress", "lineNumber": "85"}, {"id": 1, "category": {"1": ["CWE-703"], "2": ["CWE-754"], "3": ["CWE-391"]}, "title": "PMMR panic after processing an invalid TxHashSet leaves node unable to sync", "description": "Improper error handling during the processing of non-trusted PMMR data structures results in a panic in a peer thread, which leaves the node in an inconsistent state and unable to synchronize.", "severity": "Medium", "contract": "rewindable_pmmr.rs", "function": "root()", "lineNumber": "109"}, {"id": 2, "category": {"1": ["CWE-703"], "2": ["CWE-754"]}, "title": "zip-rs library panic and corrupted storage during TxHashSet processing results in node unable to sync", "description": "Lack of input validation in the zip-rs library used by Grin during the processing of TxHashSetArchive messages enables remote attackers to crash the peer thread, resulting in inconsistent state storage that prevents the node from properly synchronizing with any peer.", "severity": "Medium", "contract": "N/A", "function": "N/A", "lineNumber": "zip-0.4.2/src/read.rs:85, store/src/types.rs:66"}, {"id": 3, "category": {"1": ["CWE-703"], "2": ["CWE-228"], "3": ["CWE-229"]}, "title": "CRoaring: memory corruption and DoS while processing bitmaps", "description": "Lack of input validation during the processing of CRoaring bitmaps enables remote attackers to, at least, crash Grin nodes.", "severity": "High", "contract": "N/A", "function": "roaring_bitmap_portable_deserialize_safe", "lineNumber": "CRoaring/roaring.c:7917, 7326, 8988, 8751"}, {"id": 4, "category": {"1": ["CWE-703"]}, "title": "prune_list panic after processing an invalid TxHashSet leaves node unable to sync and restart", "description": "Improper error handling during the processing of non-trusted PruneList data structures results in a panic in a peer thread, which leaves the node in an inconsistent state and unable to synchronize.", "severity": "Medium", "contract": "store", "function": "prune_list.rs", "lineNumber": "162"}, {"id": 5, "category": {"1": ["CWE-703"], "2": ["CWE-754"]}, "title": "Disk space DoS via TxHashSetRequest p2p messages", "description": "Grin nodes can be vulnerable to disk space denial of service (DoS) attacks via TxHashSetRequest p2p protocol requests. Attackers can send multiple requests, causing the target node's filesystem to fill up and preventing it from adding new blocks to the storage layer.", "severity": "Medium", "contract": "N/A", "function": "txhashset_read", "lineNumber": "1413"}, {"id": 6, "category": {"1": ["CWE-707"], "2": ["CWE-20"]}, "title": "Nodes can be indefinitely prevented from synchronizing the blockchain via unsolicited TxHashSetArchive p2p messages", "description": "Lack of input validation in the zip-rs library used by Grin during the processing of TxHashSetArchive messages enables remote attackers to crash the peer thread, leaving storage in an inconsistent state and preventing node synchronization.", "severity": "High", "contract": "N/A", "function": "N/A", "lineNumber": "servers/src/common/adapters.rs:315, p2p/src/protocol.rs:275, chain/src/chain.rs:859"}, {"id": 7, "category": {"1": ["CWE-284"], "2": ["CWE-269"], "3": ["CWE-266"]}, "title": "Insecure file handling local privilege escalation", "description": "Insecure file handling leading to local privilege escalation", "severity": "High", "contract": "N/A", "function": "N/A", "lineNumber": "p2p/src/protocol.rs:247, chain/txhashset/txhashset.rs:1413, chain/src/chain.rs:676"}, {"id": 8, "category": {"1": ["CWE-435"], "2": ["CWE-436"], "3": ["CWE-115"]}, "title": "Nodes can be tricked into banning well-behaved peers (temporary file shared among peer threads)", "description": "Reuse of a temporary file between peer threads during the state synchronization process enables remote attackers to abuse the peer-banning mechanism to ban well-behaved peers.", "severity": "Medium", "contract": "N/A", "function": "N/A", "lineNumber": "p2p/src/protocol.rs:296"}, {"id": 9, "category": {"1": ["CWE-703"], "2": ["CWE-754"]}, "title": "Node crashes when ulimit is reached with many incoming peer connections", "description": "The Grin node panics with a 'too many open files' exception when the process reaches the configured maximum file descriptors limit. An attacker can force this scenario by quickly establishing many simultaneous connections to the target node from different IP addresses.", "severity": "High", "contract": "N/A", "function": "N/A", "lineNumber": "p2p/src/serv.rs:83"}, {"id": 10, "category": {"1": ["CWE-703"], "2": ["CWE-754"]}, "title": "High CPU usage when handling many incoming peer connections results in stuck miner and unresponsive node", "description": "An attacker can force the Grin node process to consume 100% of the host’s available CPU power by establishing many simultaneous connections to the target node from different IP addresses, stalling each connection handshake as much as allowed by the reader timeout.", "severity": "High", "contract": "N/A", "function": "N/A", "lineNumber": "141"}, {"id": 11, "category": {"1": ["CWE-703"]}, "title": "Miner thread panic after long chain reorganization", "description": "The miner thread panics after a chain reorganization, specifically when a new node with a longer chain forces the target miner to synchronize.", "severity": "High", "contract": "pmmr.rs", "function": "root() and build_block()", "lineNumber": "144"}, {"id": 12, "category": {"1": ["CWE-703"], "2": ["CWE-754"], "3": ["CWE-354"]}, "title": "Arbitrary orphan blocks can be used to flush out legitimate ones from the OrphanBlockPool", "description": "The code responsible for the chain block acceptance pipeline fails to validate the block when the block is an orphan, allowing arbitrary orphan blocks to be used to flush out legitimate ones from the OrphanBlockPool.", "severity": "Low", "contract": "N/A", "function": "process_block", "lineNumber": "96, 293, 114"}, {"id": 13, "category": {"1": ["CWE-703"], "2": ["CWE-754"], "3": ["CWE-391"]}, "title": "Known headers replay can be abused to clog victim node CPU with PoW computations", "description": "Malicious peers can continuously replay old headers through the _Header_ message, and those old headers will be validated, including their proof of work. Peers replaying already known headers are not banned and can abuse this fact to clog the victim’s CPU with PoW computations indefinitely.", "severity": "Medium", "contract": "N/A", "function": "N/A", "lineNumber": "N/A"}]}